IDENTIFICATION DIVISION.
PROGRAM-ID. HTTP-RESOURCES-SCRAPER IS RECURSIVE.
AUTHOR. Hippolyte Damay--Glorieux.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY. FUNCTION ALL INTRINSIC.
   
DATA DIVISION.
WORKING-STORAGE SECTION.
*> ERROR HANDLING
77 ABORT-MESSAGE PIC X(64).
77 ERRNO BINARY-CHAR UNSIGNED.
77 ERRNO-NAME PIC X(16).
77 ERRNO-MESSAGE PIC X(40).

01 DIR USAGE POINTER.
01 DENT USAGE POINTER.
01 DIRENT BASED.
   03 FILLER PIC X(16).
   03 D_TYPE BINARY-CHAR.
      88 DT_DIR VALUE 24.
      88 DT_REG VALUE 32.
   03 FILLER PIC X(2).
   03 D_NAME PIC X(256).
01 CURRENT-FILE PIC X(256).

LINKAGE SECTION.
01 CURRENT-FOLDER PIC X(256).
01 CURRENT-FOLDER-LENGTH PIC 9(3).
01 LEVEL PIC 9.
01 RESOURCES.
   05 RESOURCES-SIZE PIC 99.
   05 RESOURCE OCCURS 20 TIMES.
      10 RESOURCE-NAME PIC X(1024).
      10 RESOURCE-PATH PIC X(1024).
      10 RESOURCE-TYPE PIC X(1024).

PROCEDURE DIVISION USING CURRENT-FOLDER, CURRENT-FOLDER-LENGTH, LEVEL, RESOURCES.
   DISPLAY "Loading resources from folder: " CURRENT-FOLDER(1:CURRENT-FOLDER-LENGTH) "<".
   CALL "opendir" USING
      BY CONTENT CURRENT-FOLDER(1:CURRENT-FOLDER-LENGTH)
      RETURNING DIR
   END-CALL.
   IF RETURN-CODE IS EQUAL -1 THEN
      MOVE "Server call 'opendir' failed" TO ABORT-MESSAGE
      PERFORM ABORT-SERVER
   END-IF.

   DISPLAY "OPENDIR DONE".
   
   IF DIR NOT EQUAL TO NULL THEN
      CALL "readdir" USING
         BY VALUE DIR
         RETURNING DENT
      END-CALL

      DISPLAY "READDIR DONE"
      
      PERFORM UNTIL DENT IS EQUAL TO NULL
         SET ADDRESS OF DIRENT TO DENT
         INITIALIZE CURRENT-FILE
         
         STRING CURRENT-FOLDER DELIMITED BY SPACE
            "/" DELIMITED BY SIZE
            D_NAME DELIMITED BY X"00"
            INTO CURRENT-FILE
            WITH POINTER CURRENT-FOLDER-LENGTH
         END-STRING

         DISPLAY CURRENT-FILE
         DISPLAY TRIM(CURRENT-FILE) ">" D_TYPE "< LEVEL: " LEVEL 
         
         EVALUATE TRUE
            WHEN DT_DIR
               IF D_NAME(1:1) IS NOT EQUAL "." AND TRIM(CURRENT-FILE) IS NOT EQUAL TRIM(CURRENT-FOLDER) THEN
                *>  DISPLAY TRIM(CURRENT-FILE) " VS " TRIM(CURRENT-FOLDER)
                  ADD 1 TO LEVEL
                  CALL "HTTP-RESOURCES-SCRAPER" USING
                     BY CONTENT TRIM(CURRENT-FILE)
                     BY CONTENT CURRENT-FOLDER-LENGTH
                     BY CONTENT LEVEL
                     BY REFERENCE RESOURCES
                  END-CALL
               END-IF
         END-EVALUATE
        
         CALL "readdir" USING
            BY VALUE DIR
            RETURNING DENT
         END-CALL
      END-PERFORM

      DISPLAY "READING DONE"
      
      CALL "closedir" USING
         BY VALUE DIR
      END-CALL

      DISPLAY "CLOSEDIR DONE"
   ELSE
      MOVE "Server failed to open folder" TO ABORT-MESSAGE
      PERFORM ABORT-SERVER
   END-IF.

ABORT-SERVER.
   DISPLAY ABORT-MESSAGE.
   CALL 'errnomessage' USING
      BY REFERENCE ERRNO ERRNO-NAME ERRNO-MESSAGE
   END-CALL.
   DISPLAY ERRNO SPACE ERRNO-NAME ERRNO-MESSAGE.
   STOP RUN.
END PROGRAM HTTP-RESOURCES-SCRAPER.
