IDENTIFICATION DIVISION.
PROGRAM-ID. HTTP-RESOURCES-SCRAPER.
AUTHOR. Hippolyte Damay--Glorieux.

DATA DIVISION.
WORKING-STORAGE SECTION.
*> ERROR HANDLING
77 ABORT-MESSAGE PIC X(64).
77 ERRNO BINARY-CHAR UNSIGNED.
77 ERRNO-NAME PIC X(16).
77 ERRNO-MESSAGE PIC X(40).

77 DIR USAGE POINTER.
77 DENT USAGE POINTER.
01 DIRENT.
   03 
LINKAGE SECTION.
77 CURRENT-FOLDER PIC X(1024).
77 RESOURCES-FOLDER PIC X(1024).
01 RESOURCES.
   05 RESOURCES-SIZE PIC 99.
   05 RESOURCE OCCURS 20 TIMES.
      10 RESOURCE-NAME PIC X(1024).
      10 RESOURCE-PATH PIC X(1024).
      10 RESOURCE-TYPE PIC X(1024).

PROCEDURE DIVISION USING CURRENT-FOLDER, RESOURCES-FOLDER, RESOURCES
MAIN.
	CALL "opendir" USING
     	     BY CONTENT CURRENT-FOLDER
     	     RETURNING DIR
	END-CALL.
	IF RETURN-CODE IS EQUAL -1 THEN
	     MOVE "Server call 'setsockopt' failed" TO ABORT-MESSAGE
	     PERFORM ABORT-SERVER
	END-IF.

	IF DIR NOT EQUAL TO NULL THEN
	   CALL "readdir" USING
	   	BY VALUE DIR
		RETURNING DENT
	   END-CALL.

	   PERFORM UNTIL DENT EQUAL TO NULL
	

ABORT-SERVER.
	DISPLAY ABORT-MESSAGE.
	CALL 'errnomessage' USING
	     BY REFERENCE ERRNO ERRNO-NAME ERRNO-MESSAGE
	END-CALL.
	DISPLAY ERRNO SPACE ERRNO-NAME ERRNO-MESSAGE.
	STOP RUN.
END PROGRAM HTTP-RESOURCES-SCRAPER.