IDENTIFICATION DIVISION.
PROGRAM-ID. HTTP-RESPONSE-GENERATOR.
AUTHOR. Hippolyte Damay--Glorieux.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
REPOSITORY. FUNCTION ALL INTRINSIC.

DATA DIVISION.
WORKING-STORAGE SECTION.
77 OK PIC X(15) VALUE "HTTP/1.1 200 OK".
77 DUMP PIC X(20) VALUE "<h1>Hello World</h1>".
77 DUMP-SIZE PIC 9(2) VALUE 20.
77 DUMP-TYPE PIC X(9) VALUE "text/html".

01 LOCAL-RESPONSE PIC X(1024).
01 LOCAL-RESPONSE-LENGTH PIC 9(4).

01 HEADER.
   03 HEADER-STATUS-CODE PIC X(20).
   03 FILLER PIC X(2) VALUE X"0A0D".
   03 HEADER-CONTENT-LENGTH PIC X(20) VALUE "Content-Length:".
   03 FILLER PIC X(2) VALUE X"0A0D".
   03 HEADER-CONTENT-TYPE PIC X(64) VALUE "Content-Type:".
LINKAGE SECTION.
01 REQUEST.
   03 REQUEST-TYPE PIC X(4).
   03 REQUEST-PATH PIC X(2048).
   03 REQUEST-PATH-LENGTH PIC 9(4).
01 RESPONSE PIC X(1024).
01 RESPONSE-LENGTH PIC 9(4).

PROCEDURE DIVISION USING REQUEST, RESPONSE, RESPONSE-LENGTH.
   MOVE ZEROES TO LOCAL-RESPONSE-LENGTH.
   MOVE SPACES TO LOCAL-RESPONSE.

   MOVE OK TO HEADER-STATUS-CODE.
   STRING HEADER-CONTENT-LENGTH DELIMITED BY SPACES DUMP-SIZE
      INTO HEADER-CONTENT-LENGTH.
   STRING HEADER-CONTENT-TYPE DELIMITED BY SPACES DUMP-TYPE
      INTO HEADER-CONTENT-TYPE.

   DISPLAY "HEADER: " HEADER "<".
   DISPLAY "LENGTH HEADER: " LENGTH(HEADER).
   DISPLAY "DUMP: " DUMP "<".
   DISPLAY "LENGTH DUMP: " LENGTH(DUMP).
   DISPLAY "SIZE AVAILABLE: " LENGTH(LOCAL-RESPONSE).

   STRING HEADER DELIMITED BY SIZE
      X"0A0D" DELIMITED BY SIZE
      DUMP DELIMITED BY SIZE
      INTO LOCAL-RESPONSE
      WITH POINTER LOCAL-RESPONSE-LENGTH
      ON OVERFLOW DISPLAY "RESPONSE OVERFLOW !"
   END-STRING.
   
   MOVE LOCAL-RESPONSE TO RESPONSE.
   MOVE LOCAL-RESPONSE-LENGTH TO RESPONSE-LENGTH.
GOBACK.
END PROGRAM HTTP-RESPONSE-GENERATOR.
